package by.htp.hw3.mail;
// С помощью оператора while напишите программу вывода всех четных чисел в диапазоне от 2 до 100 включительно.
public class Task4 {
	public static void main(String args[]){
		int a = 2;
		while (a <= 100) {
			System.out.println(a);
			a = a + 2;
		}
	}
}
