package by.htp.hw3.mail;
// С помощью оператора while напишите программу определения суммы всех нечетных чисел в диапазоне от 1 до 99 включительно. 
public class Task5 {
	public static void main(String args[]){
		int a = 1;
		while (a <= 99) {
			System.out.println(a);
			a = a + 2;
		}
	}
}
