package by.htp.hw2.main;
/// Определить, делителем каких чисел а, b, с является число k. 
public class Task20 {
	public static void main(String args[]){
		double a = 6;
		double b = 11;
		double c = -2;
		int k = 2;
		if (a % k == 0) System.out.println("K - делитель a");
		if (b % k == 0) System.out.println("K - делитель b");
		if (c % k == 0) System.out.println("K - делитель c");
	}
	
}
