package by.htp.hw2.main;
//Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no»
public class Task2 {
	public static void main(String[] args) {
		double a = 1;
		double b = 2;
		if (a < b) System.out.println("yes");
		else System.out.println("no");
			}
}
