package by.htp.leso2.main;
//  Даны два действительных числа х и  у. Вычислить их сумму, разность, произведение и частное. 
public class Task1 {
	
	public static void main(String[] args) {
    int x = 4;
    int y = 2;
    int a;
    int b;
    int c;
    double d;
    a = x + y;
    b = x - y;
    c = x * y;
    d = x / y;
         System.out.println(a);
         System.out.println(b);
         System.out.println(c);
         System.out.println(d);
	}
}
