package by.htp.leso2.main;
//Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
public class Task7 {
	public static void main(String[] args) {
		int x = 4;
		int y;
		y = x * 2 * x;
		System.out.println(y);
	}
}
