package by.htp.leso2.main;
// Дана длина ребра куба. Найти площадь грани, площадь полной поверхности и объем этого куба. 
//
public class Task18 {
	public static void main(String[] args) {
		double a = 4;
		double b;
		double c;
		double d;
		b = a * a;
		c = b * 6;
		d = a * a * a;
		System.out.println(b);
		System.out.println(c);
		System.out.println(d);
	}
}
